In [11]:
import pandas as pd
import numpy as np

stuff = {"A": [1,2,3], "B": [4,np.nan,6], "C":[7,8,9], "D":[10,11,12]}
my_table = pd.DataFrame(stuff)
my_table

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

In [12]:
# Drop rows with null data
my_table.dropna()

   A    B  C   D
0  1  4.0  7  10
2  3  6.0  9  12

In [13]:
# Drop cols with null data
my_table.dropna(axis=1)

   A  C   D
0  1  7  10
1  2  8  11
2  3  9  12

In [14]:
# Set drop treshold
my_table.dropna(thresh=2, axis=1)

   A    B  C   D
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

In [15]:
# Fill NaNs
my_table.fillna(value="Nope")

   A     B  C   D
0  1   4.0  7  10
1  2  Nope  8  11
2  3   6.0  9  12

In [20]:
# Use math to fill NaNs
my_table.fillna(value=my_table['B'].sum())

   A     B  C   D
0  1   4.0  7  10
1  2  10.0  8  11
2  3   6.0  9  12